
kIsDebugBuild = 0;
kIRTPrevCount = 3;
art_types = {
	#art/runtime.h
    'Runtime' : [ 0x340, {
        'callee_save_methods_' : [0, ['type']],
        'pre_allocated_OutOfMemoryError_' : [ 32, ['int']],
        'pre_allocated_NoClassDefFoundError_' : [ 36, ['address']],
        'resolution_method_':[40,['']],
        'imt_conflict_method_': [44,['']],
        'imt_unimplemented_method_': [48, ['']],
        'sentinel_' : [52, ['']],
        'instruction_set_' : [56, ['']],
        'callee_save_method_frame_infos_': [60, ['']],
        'compiler_callbacks_': [108, ['']],
        'is_zygote_': [112, ['']],
        'must_relocate_': [113, ['']],
        'is_concurrent_gc_enabled_':[ 114, ['']],
        'is_explicit_gc_disabled_':[ 115, ['']],
        'dex2oat_enabled_':[116 , ['']],
        'image_dex2oat_enabled_':[ 117, ['']],
        'compiler_executable_':[120 , ['']],
        'patchoat_executable_':[ 132 , ['']],
        'compiler_options_':[ 144, ['']],
        'image_compiler_options_':[ 156, ['']],
        'image_location_':[ 168, ['']],
        'boot_class_path_string_':[ 180, ['']],
        'class_path_string_':[ 192, ['']],
        'properties_':[ 204, ['']],
        'agents_':[ 216, ['']],
        'plugins_':[ 228, ['']],
        'default_stack_size_':[ 240, ['']],
        'heap_':[244 , ['']],
        'jit_arena_pool_':[ 248, ['']],
        'arena_pool_':[ 252, ['']],
        'low_4gb_arena_pool_':[ 256, ['']],
        'linear_alloc_':[ 260, ['']],
        'max_spins_before_thin_lock_inflation_':[ 264, ['']],
        'monitor_list_':[268 , ['']],
        'monitor_pool_':[ 272, ['']],
        'thread_list_':[ 276, ['ThreadList']],
        'intern_table_':[ 280, ['']],
        'class_linker_':[ 284, ['']],
        'signal_catcher_':[ 288, ['']],
        'stack_trace_file_':[292 , ['']],
        'java_vm_':[304 , ['JavaVMExt']],
        'jit_':[ 308, ['']],
        'jit_options_':[ 312, ['']],
        'fault_message_lock_':[320 , ['']],
        'fault_message_':[ 360, ['']],
        'threads_being_born_':[372 , ['']],
        'shutdown_cond_':[376 , ['']],
        'shutting_down_':[ 380, ['']],
        'shutting_down_started_':[ 381, ['']],
        'started_':[ 382, ['']],
        'finished_starting_':[ 383, ['']],
        'vfprintf_':[ 384, ['']],
        'exit_':[ 388, ['']],
        'abort_':[ 392, ['']],
        'stats_enabled_':[ 396, ['']],
        'stats_':[ 400, ['']],
        'is_running_on_memory_tool_':[456 , ['']],
        'trace_config_':[ 460, ['']],
        'instrumentation_':[ 464, ['']],
        'main_thread_group_':[680 , ['']],
        'system_thread_group_':[684 , ['']],
        'system_class_loader_':[ 688, ['']],
        'dump_gc_performance_on_shutdown_':[692 , ['']],
        'preinitialization_transaction_':[696 , ['']],
        'verify_':[ 700, ['']],
        'allow_dex_file_fallback_':[ 701, ['']],
        'cpu_abilist_':[ 704, ['']],
        'target_sdk_version_':[ 716, ['']],
        'implicit_null_checks_':[ 720, ['']],
        'implicit_so_checks_':[721 , ['']],
        'implicit_suspend_checks_':[ 722, ['']],
        'no_sig_chain_':[ 723, ['']],
        'force_native_bridge_':[ 724, ['']],
        'is_native_bridge_loaded_':[ 725, ['']],
        'is_native_debuggable_':[ 726, ['']],
        'is_java_debuggable_':[ 727, ['']],
        'zygote_max_failed_boots_':[ 728, ['']],
        'experimental_flags_':[ 732, ['']],
        'fingerprint_':[ 736, ['']],
        'oat_file_manager_':[748 , ['']],
        'is_low_memory_mode_':[ 752, ['']],
        'safe_mode_':[ 753, ['']],
        'dump_native_stack_on_sig_quit_':[754 , ['']],
        'pruned_dalvik_cache_':[ 755, ['']],
        'process_state_':[ 756 , ['']],
        'zygote_no_threads_':[ 760, ['']],
        'env_snapshot_':[764, ['']],
        'system_weak_holders_':[780, ['']],
        'cha_': [792, ['']],
        'callbacks_': [796, ['']],
        'deoptimization_counts_': [800, ['']]
      }],
     'Heap' : [ 0x0388, {
	'continuous_spaces_' : [0, ['']],
	'discontinous_spaces_' : [12, ['']],
	'alloc_spaces_' : [24, ['']],
	'non_moving_space_' : [36, ['']],
	'large_object_space_' : [52, ['LargeObjectSpace']]
	}],
    
     'JavaVMExt': [0x88, {
     	'DW_TAG_inheritance'  : [0, ['pointer']],
     	'runtime_' : [4,['Runtime']],
     	'check_jni_abort_hook_' : [ 8,['pointer']],
     	'check_jni_abort_hook_data_' : [12 ,['pointer']],
     	'check_jni_' : [ 16,['bool']],
     	'force_copy_' :[ 17,['bool']],
     	'tracing_enabled_' : [ 18,['const bool']],
     	'trace_' : [ 20,['std:string']],
     	'globals_' : [ 32,['IndirectReferenceTable']],
     	'libraries_' : [ 64,['std::unique_ptr']],
     	'unchecked_functions_' : [68 ,['pointer']],
    	'weak_globals_' : [ 72,['IndirectReferenceTable']],
    	'allow_accessing_weak_globals_' : [104 ,['Atomic<bool>']],
     	'weak_globals_add_condition_' : [ 108,['ConditionVariable']],
     	'env_hooks_' : [124 ,['std::vector<GetEnvHook>']]
     }],
     
	
	
	
       
    'Class_Obj' : [ 0x78, {
    	'inheritance':[ 0,['']],
    	'class_loader_':[8, ['Object']],
    	'component_type_':[12 ,['']],
    	'dex_cache_':[ 16,['']],
    	'ext_data_':[20 ,['']],
    	'iftable_':[ 24,['']],
		'name_':[28 ,['String_Obj']],
		'super_class_':[32 ,['']],
		'vtable_':[ 36,['']],
		'ifields_':[ 40,['']],
		'methods_':[ 48,['']],
		'sfields_':[56 ,['']],
		'access_flags_':[64 ,['']],
		'class_flags_':[68 ,['']],
		'class_size_':[ 72,['']],
		'clinit_thread_id_':[76 ,['']],
		'dex_class_def_idx_':[ 80,['']],
		'dex_type_idx_':[ 84,['']],
		'num_reference_instance_fields_':[ 88,['']],
		'num_reference_static_fields_':[ 92,['']],
		'object_size_':[ 96,['']],
		'object_size_alloc_fast_path_':[100,['']],
		'primitive_type_':[104 ,['']],
		'reference_instance_offsets_':[108 ,['']],
		'status_':[ 112,['']],
		'copied_methods_offset_':[116 ,['']],
		'virtual_methods_offset_':[ 118,['']],
    }],
    
	
	
	
	'DexCache':[0x88,{
		'inheritance':[0,['']],
		'location_':[8,['']],
		'num_resolved_call_sites_':[12,['']],
		'dex_file_':[16,['']],
		'resolved_call_sites_':[24,['']],
		'resolved_fields_':[32,['']],
		'resolved_method_types_':[40,['']],
		'resolved_methods_':[48,['']],
		'resolved_types_':[56,['']],
		'strings_':[64,['']],
		'num_resolved_fields_':[72,['']],
		'num_resolved_method_types_':[76,['']],
		'num_resolved_methods_':[80,['']],
		'num_resolved_types_':[84 ,['']],
		'num_strings_':[88,['']],	
	}],
	'DexFile':[0x50,{
		'begin_':[4,['pointer']], 
		'size_': [8,['integer']],
		'location_':[12,['std::string']],
		'location_checksum_': [24,['']],
		'mem_map_':[28,['pointer']],
		'header_':[32,['pointer']],
		'string_ids_':[36,['pointer']],
		'type_ids_':[40,['pointer']], 
		'field_ids_':[44,['pointer']], 
		'method_ids_':[48,['pointer']],
		'proto_ids_':[52,['pointer']],
		'class_defs_':[56,['pointer']], 
		'method_handles_':[ 60,['pointer']],
		'num_method_handles_':[64,['integer']],
		'call_site_ids_':[68,['pointer']],
		'num_call_site_ids_':[72,['integer']],
		'oat_dex_file_':[76,['pointer']],
	}],
	'FieldId':[0x8, {
		'class_idx_':[0,['']],
		'type_idx_':[2,['']],
		'name_idx_':[4,['']],
		}],
	'StringId':[0x4, {
		'string_data_off_': [0,['']],
		}],
	'TypeId':[0x4, {
		'descriptor_idx_': [0,['']],
		}],
	
	
	
	
	'LargeObjectSpace' : [ 0x48, {
  		'Discontinous_Space': [0x1c,{
    		'Space':[0,['']],
    		'live_bitmap_':[20,['']],
    		'mark_bitmap_':[24,['']],
  		}],
  		'AllocSpace' : [0x4, {
        	'_vtr$AllocSpace':[28,['']],
  		}] ,   
  		'num_bytes_allocated_':[32,['']],
  		'num_objects_allocated_' :[40,['']],
  		'total_bytes_allocated_' :[48,['']],
  		'total_objects_allocated_': [56,['']],
  		'begin_' :[64,['']],
  		'end_' :[68,['']],
    }],
	'LargeObjectMapSpace':[0x80,{
		'Inheritance':[0, ['LargeObjectSpace']],
		'_lock':[72,['']],
		'LargeObject': [112, ['LargeObject']],
		'Unknown':[120,['']],#AllocationTracking-SafeMap
	}],
	'LargeObject':[0x8,{
		'MemMap':[0, ['Pointer']],
		'is_Zygote':[4,['Boolean']],
	}],

}

#	'LargeObjectMapSpace' :
''''RegionSpace' : [ 0xa8, {
	'Space':[0,['']],
	'begin_':[20,['']],
	'end_':[24,['']],
	'limit_':[28,['']],
	'mem_map_':[32,['']],
	'_vptr$AllocSpace':[36, ['']], 
	'live_bitmap_':[40,['']],
	'mark_bitmap_':[44,['']],
	'temp_bitmap_':[48,['']],
	'region_lock_': [56],
	'time_': [96],
	'num_regions_': [100],
	'num_non_free_regions_': [104],
	'regions_': [108],
	'non_free_region_index_limit_': [112],
	'current_region_': [116],
	'evac_region_': [120],
	'full_region_': [124],
	'mark_bitmap_': [164],
}]

'Region' : [ 0x28, {
	'idx_' : [0], 
	'begin_': [4],
	'top_': [8],
	'end_': [12],
	'state_': [16],
	'type_': [17],
	'objects_allocated_': [20],
	'alloc_time_': [24],
	'live_bytes_': [28],
	'is_newly_allocated_': [32],
	'is_a_tlab_': [33],
	'thread_': [36],
}]

'''
